plugin/test/mutants/M100.diff
# M100: the retirement is armed by a tombstone that is not this record's own
--- a/plugin/src/sync/pull.ts
+++ b/plugin/src/sync/pull.ts
@@ -939,7 +939,7 @@
     const removed = await removeFolder(context, path, shown);
     context.state.forgetFolder(path);
     if (retiring?.fileId === change.file_id) bury(context, change.file_id, change.version_id, path, true, change.ts);
-    if (retiring?.fileId === change.file_id && (context.state.data.syncFolders ?? []).includes(path)) {
+    if (retiring !== undefined && (context.state.data.syncFolders ?? []).includes(path)) {
       context.state.data.retiredRoots[path] = change.file_id;
     }
     await context.state.save();
