plugin/test/mutants/M442.diff
# M442: a new session cannot see the old session's write in flight, and reads under it
--- a/plugin/src/state.ts
+++ b/plugin/src/state.ts
@@ -482,8 +482,8 @@
       this.serializedSecret = serialized;
     }
     try {
-      await (this.lease.writing = this.store.saveData({ ...bookkeeping, storageVersion: 1, installationId: this.installationId,
-        credentialRef: ref, credentialRevision: selected.revision }));
+      await this.store.saveData({ ...bookkeeping, storageVersion: 1, installationId: this.installationId,
+        credentialRef: ref, credentialRevision: selected.revision });
     } catch { throw new StateStorageError("metadata_write_failed"); }
     this.record = selected;
   }
