plugin/test/mutants/M107.diff
# M107: the folder record's hold is not restored at the next start
--- a/plugin/src/sync/engine.ts
+++ b/plugin/src/sync/engine.ts
@@ -632,7 +632,6 @@
     if (!this.running) return;
     // FIRST, AND BEFORE THE PASS THAT QUEUES THE FILE WORK (review round 4,
     // finding 3).
-    this.restoreFolderBarriers();
     // Cleaning up is never a reason not to sync.
     await host.sweep?.().catch((error: unknown) =>
       host.log(`host path_class=temp decision=failed reason=sweep code=${(error as { code?: string }).code ?? "none"}`));
