plugin/test/mutants/M721.diff
# M721: a peer answering our own publication bypasses the loop budget
--- a/plugin/src/sync/pull.ts
+++ b/plugin/src/sync/pull.ts
@@ -2038,7 +2038,7 @@
   const remote = remotes.get(change.device_id);
   const independent = remote !== undefined && remote !== change.version_id &&
     reaches(file.versions, change.version_id, remote) &&
-    !reaches(file.versions, change.version_id, localVersionId);
+    true;
   if (tally.left !== found || independent) tally.count = 0;
   if (independent) context.host.log(`pull decision=merge_budget_reset reason=independent_peer_progress file=${change.file_id} seq=${change.seq} tracked_authors=${remotes.size}`);
   remotes.set(change.device_id, change.version_id);
