plugin/test/mutants/M721.diff
# M721: a peer answering our own publication bypasses the loop budget
--- a/plugin/src/sync/pull.ts
+++ b/plugin/src/sync/pull.ts
@@ -2020,7 +2020,7 @@
   // typist may stop before the other; the remaining edits still merge here.
   const independent = tally.remote !== undefined && tally.remote !== change.version_id &&
     reaches(file.versions, change.version_id, tally.remote) &&
-    !reaches(file.versions, change.version_id, localVersionId);
+    true;
   if (tally.left !== found || independent) tally.count = 0;
   if (independent) context.host.log(`pull decision=merge_budget_reset reason=independent_peer_progress file=${change.file_id} seq=${change.seq}`);
   tally.remote = change.version_id;
