plugin/test/mutants/M724.diff
# M724: a missing pending change bypasses move discovery and publishes a tombstone
--- a/plugin/src/sync/engine.ts
+++ b/plugin/src/sync/engine.ts
@@ -1411,7 +1411,8 @@
       // watcher event. Ask where the note went through the same bounded
       // move check as a delete event before publishing any tombstone.
       context.host.log("watch path_class=file decision=deferred reason=missing_during_settle");
-      this.deleted(path);
+      this.deletions.add(path);
+      this.enqueue(path);
       return;
     }
     const key = `${path}:${stat.mtime}:${stat.size}`;
