plugin/test/mutants/M125.diff
# M125: a note whose mtime moved is taken for its recorded version
--- a/plugin/src/sync/pull.ts
+++ b/plugin/src/sync/pull.ts
@@ -2344,7 +2344,7 @@
   if (ours.versionId === "") return null;
   if (ours.sha256 !== (await sidDigest(change.sids))) return null;
   const stat = await context.host.stat(path);
-  if (stat === null || stat.mtime !== ours.mtime || stat.size !== ours.size) return null;
+  if (stat === null || stat.size !== ours.size) return null;
   return stat;
 }
 
