plugin/test/mutants/M133.diff
# M133: a record of other bytes that appears during the post is settled as a duplicate
--- a/plugin/src/sync/push.ts
+++ b/plugin/src/sync/push.ts
@@ -305,7 +305,7 @@
   // it settles the pair here, by the rule every other device applies to it.
   if (record === undefined) {
     const adopted = context.state.fileByPath(path);
-    if (adopted !== undefined && adopted.sha256 === digest) {
+    if (adopted !== undefined) {
       return await settleDuplicate(context, path, adopted, { fileId, versionId: ack.versionId, mtime: stat.mtime, size: stat.size, sha256: digest }, ack.ack);
     }
   }
