plugin/test/mutants/M148.diff
# M148: onload waits for the first start, holding Obsidian's loading screen until the server answers
--- a/plugin/src/main.ts
+++ b/plugin/src/main.ts
@@ -1625,6 +1625,7 @@
       if (this.state.paired) await this.startEngine();
       if (this.isCurrent(generation)) void this.checkForUpdate();
     });
+    await this.firstStart;
   }
 
   override onunload(): void {
