plugin/test/mutants/M152.diff
# M152: two different merges of one pair are never merged again, so every later version of the note becomes a conflict copy
--- a/plugin/src/sync/pull.ts
+++ b/plugin/src/sync/pull.ts
@@ -2192,8 +2192,7 @@
       const decoder = new TextDecoder();
       // Even a clean-looking append can replay text from the other common
       // ancestor. Resolve that shared base before comparing the new edits.
-      const shared = mergeBase === baseManifest
-        ? await crissCrossBase(context, file, change, [localVersionId, change.version_id], baseId, decoder.decode(base)) : null;
+      const shared = null as string | null | false;
       const crossed = typeof shared === "string";
       const merged = shared === false ? { ok: false as const, reason: "overlap" as const }
         : threeWayMerge(shared ?? decoder.decode(base), decoder.decode(mine), decoder.decode(theirs));
