plugin/test/mutants/M168.diff
# M168: the status reads idle while a note waits on this device's own push to settle a fork
--- a/plugin/src/sync/engine.ts
+++ b/plugin/src/sync/engine.ts
@@ -1806,7 +1806,6 @@
       const more = parked.length > 1 ? ` (and ${parked.length - 1} more: Show sync status)` : "";
       return { kind: "error", message: unwritableText(newest.path, newest.reason) + more };
     }
-    if (waiting > 0) return { kind: "syncing", pending: waiting };
     return { kind: "idle" };
   }
 
