plugin/test/mutants/M169.diff
# M169: a note stays counted as waiting after its fork is settled, and the status reads syncing with nothing left to settle
--- a/plugin/src/sync/pull.ts
+++ b/plugin/src/sync/pull.ts
@@ -1883,8 +1883,6 @@
       );
     }
   }
-  // Settled now, or left for a push again (`deferred`), which counts it anew.
-  context.forked.delete(change.file_id);
   const result = await resolve(context, file, change, theirManifest, localPath, localVersionId, tally, tripped);
   // What the resolution LEFT: a write stamps its own commit (`resolve`), never
   // a later look, which could be the user's next save. One that wrote nothing
