plugin/test/mutants/M176.diff
# M176: an accepted address does not end the refusal, so the next one is silent
--- a/plugin/src/ui/settings.ts
+++ b/plugin/src/ui/settings.ts
@@ -208,7 +208,6 @@
               this.shownRefusal = refusal;
               return;
             }
-            this.shownRefusal = null;
             this.plugin.state.data.serverUrl = url;
             // State reports persistence failure and stops sync through its host hook.
             void this.plugin.state.save().catch(() => {});
