plugin/test/mutants/M184.diff
# M184: with the system Trash unavailable, a note deleted on another device is removed for good instead of going to .trash
--- a/plugin/src/main.ts
+++ b/plugin/src/main.ts
@@ -1143,7 +1143,10 @@
     if (option === "none") {
       await vault.adapter.remove(path);
       bin = "none";
-    } else if (option === "local" || !(await vault.adapter.trashSystem(path).catch(() => false))) {
+    } else if (option !== "local" && !(await vault.adapter.trashSystem(path).catch(() => false))) {
+      await vault.adapter.remove(path);
+      bin = "none";
+    } else if (option === "local") {
       await vault.adapter.trashLocal(path);
       bin = option === "local" ? "local" : "local reason=system_refused";
     }
