plugin/test/mutants/M185.diff
# M185: a system Trash that errors stops sync with an error instead of sending the note to .trash
--- a/plugin/src/main.ts
+++ b/plugin/src/main.ts
@@ -1143,7 +1143,7 @@
     if (option === "none") {
       await vault.adapter.remove(path);
       bin = "none";
-    } else if (option === "local" || !(await vault.adapter.trashSystem(path).catch(() => false))) {
+    } else if (option === "local" || !(await vault.adapter.trashSystem(path))) {
       await vault.adapter.trashLocal(path);
       bin = option === "local" ? "local" : "local reason=system_refused";
     }
