plugin/test/mutants/M187.diff
# M187: on an Obsidian without the preference lookup, every deletion from another device fails
--- a/plugin/src/main.ts
+++ b/plugin/src/main.ts
@@ -1138,7 +1138,7 @@
       await this.plugin.app.fileManager.trashFile(file);
       return;
     }
-    const option = (vault as App["vault"] & { getConfig?(key: string): unknown }).getConfig?.("trashOption");
+    const option = (vault as App["vault"] & { getConfig(key: string): unknown }).getConfig("trashOption");
     let bin = "system";
     if (option === "none") {
       await vault.adapter.remove(path);
