plugin/test/mutants/M20.diff
# M20: a copy that failed under a moving source is raised, not refused
--- a/plugin/src/sync/pull.ts
+++ b/plugin/src/sync/pull.ts
@@ -1115,7 +1115,6 @@
     // budget is what catches a note that grew or shrank mid-copy, and it
     // refuses rather than publishing a torn one. Anything else is a real
     // failure and is raised.
-    if (await changed()) return refuse(null);
     throw error;
   }
   if (landed === null) return null;
