plugin/test/mutants/M200.diff
# M200: a folder renamed in Finder with Obsidian open is deleted on the other devices and comes back under new ids: the delete no longer waits for its create
--- a/plugin/src/sync/engine.ts
+++ b/plugin/src/sync/engine.ts
@@ -678,7 +678,8 @@
     // decides for this path now, as the queued deletion used to.
     const queued = this.queue.indexOf(path);
     if (queued !== -1) this.queue.splice(queued, 1);
-    this.vanish([path]);
+    this.deletions.add(path);
+    this.enqueue(path);
   }
 
   /**
