plugin/test/mutants/M21.diff
# M21: the fake's create-only writer accepts a short copy
--- a/plugin/test/fake.mjs
+++ b/plugin/test/fake.mjs
@@ -270,7 +270,6 @@ export class FakeHost {
       },
       commit: async (mtime) => {
         check();
-        if (at !== size) throw new Error("copy content is incomplete");
         if (this.resolve(path) !== undefined) throw new Error("destination exists");
         return writer.commit(mtime);
       },
