plugin/test/mutants/M211.diff
# M211: Confirm deletions deletes notes that are back in the vault under a new name
--- a/plugin/src/sync/engine.ts
+++ b/plugin/src/sync/engine.ts
@@ -1032,7 +1032,7 @@
     const held = this.heldDeletions;
     this.heldDeletions = [];
     this.bulkNoticeShown = false;
-    this.vanish(held);
+    for (const path of held) { this.deletions.add(path); this.enqueue(path); }
     this.options.host.log(`reconcile decision=confirmed reason=bulk_deletion queued=${held.length}`);
   }
 
