plugin/test/mutants/M222.diff
# M222: a parked file with a damaged reason is named as "Cannot write X here: undefined"
--- a/plugin/src/sync/pull.ts
+++ b/plugin/src/sync/pull.ts
@@ -171,7 +171,7 @@
   // A chunk the server lost is nothing wrong with THIS device, so it is not
   // said as if it were (2026-09-24 verification, X2).
   if (reason === "unknown_chunk") return `Cannot download ${path}: ${UNWRITABLE[reason]}`;
-  return `Cannot write ${path} here: ${UNWRITABLE[reason] ?? "it could not be written"}`;
+  return `Cannot write ${path} here: ${UNWRITABLE[reason]}`;
 }
 
 /** A record this device cannot write for a reason local to that one file or chunk. */
