plugin/test/mutants/M223.diff
# M223: a data file can point a parked retry at any server route instead of a file id
--- a/plugin/src/state.ts
+++ b/plugin/src/state.ts
@@ -300,7 +300,7 @@
     for (const [fileId, record] of Object.entries(parked)) {
       // The file id goes into a request path and the path onto the screen;
       // the reason only chooses words, so a damaged one keeps the record.
-      if (!isHex(fileId, 16) || !isRecord(record) || !isVaultPath(record["path"])) continue;
+      if (!isRecord(record) || !isVaultPath(record["path"])) continue;
       data.parked[fileId] = { path: record["path"], reason: str(record["reason"], "") };
     }
   }
