plugin/test/mutants/M226.diff
# M226: a parked attachment deleted on another device stays named in the status bar until the next slow retry
--- a/plugin/src/sync/engine.ts
+++ b/plugin/src/sync/engine.ts
@@ -1927,7 +1927,6 @@
     // First materialisation and renames can establish a different tracked
     // path. Only an authenticated ordinary version supplies this evidence.
     if (incoming) await remember();
-    if (context.state.data.parked[change.file_id] !== undefined) await this.retryOne(context, change.file_id);
     return result;
   }

