plugin/test/mutants/M226.diff
# M226: a parked attachment deleted on another device stays named in the status bar until the next slow retry
--- a/plugin/src/sync/engine.ts
+++ b/plugin/src/sync/engine.ts
@@ -1801,7 +1801,6 @@
       this.park(context, change.file_id, error);
       return null;
     }
-    if (context.state.data.parked[change.file_id] !== undefined) await this.retryOne(context, change.file_id);
     return result;
   }
 
