plugin/test/mutants/M227.diff
# M227: every change the feed applies asks the server about its file again and logs a bogus release
--- a/plugin/src/sync/engine.ts
+++ b/plugin/src/sync/engine.ts
@@ -1801,7 +1801,7 @@
       this.park(context, change.file_id, error);
       return null;
     }
-    if (context.state.data.parked[change.file_id] !== undefined) await this.retryOne(context, change.file_id);
+    await this.retryOne(context, change.file_id);
     return result;
   }
 
