plugin/test/mutants/M234.diff
# M234: a file parked again later waits as long as the last episode's backoff had grown, not one minute
--- a/plugin/src/sync/engine.ts
+++ b/plugin/src/sync/engine.ts
@@ -1729,12 +1729,6 @@
 
   /** Arm the next pass, one doubling later; with nothing parked, disarm and start over. */
   private armParkRetry(): void {
-    if (Object.keys(this.options.state.data.parked).length === 0) {
-      if (this.parkHandle !== null) this.timers.clear(this.parkHandle);
-      this.parkHandle = null;
-      this.parkDelay = 0;
-      return;
-    }
     if (this.parkHandle !== null || !this.running) return;
     this.parkDelay = Math.min(PARK_RETRY_MAX_MS, this.parkDelay === 0 ? PARK_RETRY_MS : this.parkDelay * 2);
     this.parkHandle = this.timers.set(() => {
