plugin/test/mutants/M236.diff
# M236: after one network failure the feed never applies another change
--- a/plugin/src/sync/engine.ts
+++ b/plugin/src/sync/engine.ts
@@ -1659,7 +1659,7 @@
    * error cannot stop every later pull.
    */
   private exclusive(work: () => Promise<void>): Promise<void> {
-    return (this.pulling = this.pulling.then(work, work));
+    return (this.pulling = this.pulling.then(work));
   }
 
   /**
