plugin/test/mutants/M238.diff
# M238: one parked file the server refuses stops every other parked file from being retried, and Sync now fails
--- a/plugin/src/sync/engine.ts
+++ b/plugin/src/sync/engine.ts
@@ -2115,17 +2115,7 @@
       for (const fileId of Object.keys(context.state.data.parked)) {
         if (!this.running) return;
         if (trigger === "timer" && context.state.data.parked[fileId]?.reason === "active_editor") continue;
-        try {
-          if (await this.retryOne(context, fileId)) released++;
-        } catch (error) {
-          // Not this record's fault, so nothing is released and nothing new
-          // is said; an unreachable server ends the pass, the next one asks.
-          context.host.log(
-            `feed decision=deferred reason=${error instanceof ApiError ? `http_${error.status}` : "failed"} ` +
-              `file=${fileId} trigger=${trigger}`,
-          );
-          if (error instanceof ApiError && error.code === "unreachable") break;
-        }
+        if (await this.retryOne(context, fileId)) released++;
       }
       await context.state.save();
       context.host.log(
