plugin/test/mutants/M243.diff
# M243: Sync now with deletions held back says nothing about them
--- a/plugin/src/sync/engine.ts
+++ b/plugin/src/sync/engine.ts
@@ -2230,12 +2230,6 @@
     await this.reconcile();
     // The command that "syncs everything" did not send the deletions the user
     // is still being asked about, and says so rather than nothing (#172).
-    if (pending && this.heldDeletions.length > 0) {
-      this.options.host.notify(
-        `obsync is still holding back ${this.heldDeletions.length} deletions: Sync now does not send them. Put ` +
-          "the notes back, or, if you really deleted them, confirm it under Settings, obsync, \"Deletions held back\".",
-      );
-    }
     const queued = this.queue.length;
     const inFlight = this.active;
     await this.drain();
