plugin/test/mutants/M247.diff
# M247: a lost deletion decided from an older version is re-sent after the note moved on and was deleted again, forking the file on the server
--- a/plugin/src/sync/push.ts
+++ b/plugin/src/sync/push.ts
@@ -454,7 +454,7 @@
  * so the line says how stale that decision had become.
  */
 async function stillGone(context: SyncContext, path: string, record: FileState, decided: number): Promise<boolean> {
-  const same = context.state.fileByPath(path) === record;
+  const same = context.state.fileByPath(path) !== undefined;
   const gone = same && (await context.host.stat(path)) === null;
   const reason = gone ? "still_gone" : same ? "file_present" : "record_changed";
   context.host.log(`push path_class=tombstone decision=${gone ? "resent" : "withdrawn"} reason=${reason} file=${record.fileId} ` +
