plugin/test/mutants/M273.diff
# M273: Pair this device, or a pairing link, silently replaces the identity of a device that syncs
--- a/plugin/src/ui/modals.ts
+++ b/plugin/src/ui/modals.ts
@@ -264,15 +264,6 @@
     // sync against another server's records doubled the vault. Leaving first
     // clears all three; a pairing link opened here, even one this device
     // made, claims nothing.
-    if (this.plugin.state.paired) {
-      this.plugin.log("pairing role=claimant decision=refused reason=already_paired");
-      fail(new Error(
-        `This device already syncs with ${this.plugin.state.data.serverUrl} as "${this.plugin.deviceName()}", ` +
-          "so nothing was claimed. To pair it again, use Leave this server in obsync's settings first.",
-      ));
-      this.close();
-      return;
-    }
     try {
       this.waiting = true;
       // BEFORE ANY REQUEST (issue #180): a vault inside a synced vault that
