plugin/test/mutants/M275.diff
# M275: a note with the same name and size but other bytes counts as already in the vault, so a second vault can pair unasked
--- a/plugin/src/main.ts
+++ b/plugin/src/main.ts
@@ -2200,7 +2200,7 @@
       local++;
       const there = held?.get(file.path);
       const same = there !== undefined && there.size === file.size &&
-        (there.sha256 === "" || hex(await sha256(await this.host.read(file.path))) === there.sha256);
+        (there.sha256 === "" || there.sha256 !== "");
       if (!same) unknown++;
     }
     this.log(
