plugin/test/mutants/M28.diff
# M28: any held answer enters the rule, not only one about the destination
--- a/plugin/src/sync/pull.ts
+++ b/plugin/src/sync/pull.ts
@@ -1454,14 +1454,8 @@
     // does, the rule hands the version to `updateSettled`, which re-checks
     // that source before writing a byte. Trashing a source that holds an
     // unpushed edit is the loss issue #98 is about.
-    if (atTarget === "other_file" || atTarget === "no_record") {
-      const decided = await sameNameTiebreak(context, change, manifest, atTarget);
-      if (decided !== null) return decided;
-    } else if (atTarget === "local_edit" && localPath === manifest.path && local !== undefined) {
-      return await reconcile(context, await context.transport.getFile(change.file_id), change, manifest, localPath, local.versionId);
-    } else {
-      return await keepBoth(context, change, manifest);
-    }
+    const decided = await sameNameTiebreak(context, change, manifest, held as "other_file" | "no_record");
+    if (decided !== null) return decided;
   }
 
   // NOTHING MOVED AND NOTHING CHANGED, SO NOTHING IS FETCHED (issue #108).
