plugin/test/mutants/M28.diff
# M28: any held answer enters the rule, not only one about the destination
--- a/plugin/src/sync/pull.ts
+++ b/plugin/src/sync/pull.ts
@@ -936,12 +936,8 @@ async function applyVersion(context: SyncContext, change: ChangeRecord): Promise
     // does, the rule hands the version to `updateSettled`, which re-checks
     // that source before writing a byte. Trashing a source that holds an
     // unpushed edit is the loss issue #98 is about.
-    if (atTarget === "other_file" || atTarget === "no_record") {
-      const decided = await sameNameTiebreak(context, change, manifest, atTarget);
-      if (decided !== null) return decided;
-    } else {
-      return await keepBoth(context, change, manifest);
-    }
+    const decided = await sameNameTiebreak(context, change, manifest, held as "other_file" | "no_record");
+    if (decided !== null) return decided;
   }
 
   // A REMOTE RENAME IS A RENAME HERE TOO (issue #108, owner ruling
