plugin/test/mutants/M289.diff
# M289: temps a quit left in any folder below the vault root are never removed
--- a/plugin/src/main.ts
+++ b/plugin/src/main.ts
@@ -582,7 +582,7 @@
       if (stat === null) continue;
       if (temps !== undefined && stat.isFile() && WRITE_TEMP.test(name)) temps.push(desktop.path.resolve(at, name));
       if (stat.isDirectory()) {
-        if (inSyncTree(path, folders)) await this.walk(desktop, path, out, depth + 1, temps);
+        if (inSyncTree(path, folders)) await this.walk(desktop, path, out, depth + 1);
         continue;
       }
       if (!stat.isFile() || !inSyncScope(path, folders)) continue;
