plugin/test/mutants/M299.diff
# M299: a file stamped with a whole second in the future schedules a re-read a day away
--- a/plugin/src/sync/engine.ts
+++ b/plugin/src/sync/engine.ts
@@ -1533,7 +1533,7 @@
     const record = context.state.fileByPath(path);
     if (record === undefined || record.mtime % 1000 !== 0) return;
     const age = asked - record.mtime;
-    if (Math.abs(age) >= MTIME_STEP_MS) return;
+    if (age >= MTIME_STEP_MS) return;
     const delay = MTIME_STEP_MS - age;
     context.host.log(`push path_class=file decision=recheck reason=coarse_mtime delay_ms=${delay}`);
     this.timers.set(() => this.enqueue(path), delay);
