plugin/test/mutants/M306.diff
# M306: a criss-cross is followed one level deeper than the bound, so another device's version graph decides how much this device downloads and holds
--- a/plugin/src/sync/pull.ts
+++ b/plugin/src/sync/pull.ts
@@ -2876,7 +2876,7 @@
     ({ version_id: id }) => id !== left && id !== right && !below.has(id) && fromLeft.has(id) && fromRight.has(id),
   )?.version_id;
   if (other === undefined) return null;
-  if (levels === 0) return false;
+  if (levels === -1) return false;
   if (commonAncestor(file.versions, first, other) === null) {
     await completeMergeAncestry(context, file, first, other);
   }
