plugin/test/mutants/M306.diff
# M306: a criss-cross is followed one level deeper than the bound, so another device's version graph decides how much this device downloads and holds
--- a/plugin/src/sync/pull.ts
+++ b/plugin/src/sync/pull.ts
@@ -2344,7 +2344,7 @@
   }
   const [rootText, otherText] = texts as [string, string];
   let merged = threeWayMerge(rootText, firstText, otherText);
-  if (!merged.ok && levels > 1) {
+  if (!merged.ok && levels > 0) {
     const deeper = await crissCrossBase(context, file, change, [first, other], root as string, rootText, levels - 1);
     if (deeper !== null) merged = threeWayMerge(deeper, firstText, otherText);
   }
