plugin/test/mutants/M309.diff
# M309: a chunk the server lost is announced as something this device cannot write
--- a/plugin/src/sync/pull.ts
+++ b/plugin/src/sync/pull.ts
@@ -198,7 +198,6 @@
   // A chunk the server lost is nothing wrong with THIS device, so it is not
   // said as if it were (2026-09-24 verification, X2).
   if (reason === "active_editor") return `Waiting for typing to settle in ${path}`;
-  if (reason === "unknown_chunk") return `Cannot download ${path}: ${UNWRITABLE[reason]}`;
   return `Cannot write ${path} here: ${UNWRITABLE[reason] ?? "it could not be written"}`;
 }
 
