plugin/test/mutants/M311.diff
# M311: typing still only in the editor is lost when the note's last save was not published in the last few seconds
--- a/plugin/src/sync/pull.ts
+++ b/plugin/src/sync/pull.ts
@@ -1184,7 +1184,7 @@
   const at = context.pushedAt.get(path);
   const age = at === undefined ? -1 : context.now() - at;
   return {
-    held: editor === "unsaved" || (at !== undefined && age <= EDITING_WINDOW_MS),
+    held: (at !== undefined && age <= EDITING_WINDOW_MS),
     fields: ` editor=${editor} age_ms=${age} budget_ms=${EDITING_WINDOW_MS}`,
   };
 }
