plugin/test/mutants/M314.diff
# M314: a note open on this device and edited once can no longer be deleted from another device for the rest of the session
--- a/plugin/src/sync/pull.ts
+++ b/plugin/src/sync/pull.ts
@@ -1184,7 +1184,7 @@
   const at = context.pushedAt.get(path);
   const age = at === undefined ? -1 : context.now() - at;
   return {
-    held: editor === "unsaved" || (at !== undefined && age <= EDITING_WINDOW_MS),
+    held: editor === "unsaved" || (at !== undefined && age <= Number.MAX_SAFE_INTEGER),
     fields: ` editor=${editor} age_ms=${age} budget_ms=${EDITING_WINDOW_MS}`,
   };
 }
