plugin/test/mutants/M318.diff
# M318: the typing device is told twice about one deletion: once when the note is kept, again at the next save
--- a/plugin/src/sync/pull.ts
+++ b/plugin/src/sync/pull.ts
@@ -1317,7 +1317,6 @@
           // Told, once per file (`notifyKeptDeletion`): the revive sits beside
           // the tombstone, so this device's next save of the note meets the
           // same deletion again, through the fork guard.
-          context.refused.add(change.file_id);
           context.host.notify(
             `obsync: "${localPath}" was deleted on another device after this one changed it. ` +
               "The copy here was kept and published again, so it is back on every device.",
