plugin/test/mutants/M320.diff
# M320: the plugin's memory of recent saves grows with every note it publishes, for the life of the plugin
--- a/plugin/src/sync/engine.ts
+++ b/plugin/src/sync/engine.ts
@@ -1535,10 +1535,6 @@
       const now = context.now();
       context.pushedAt.delete(path);
       context.pushedAt.set(path, now);
-      for (const [old, at] of context.pushedAt) {
-        if (now - at <= EDITING_WINDOW_MS) break;
-        context.pushedAt.delete(old);
-      }
       if (outcome.ack?.conflicted) await this.reconcileFile(outcome.fileId);
     } catch (error) {
       // A path this device may not sync is a decision, not a failure: it is
