plugin/test/mutants/M325.diff
# M325: typing in one of two panes open on the same note is lost when another device deletes it
--- a/plugin/src/main.ts
+++ b/plugin/src/main.ts
@@ -1591,7 +1591,7 @@
     if (!file) return null;
     const lines = (text: string): string => text.replace(/\r\n?/g, "\n");
     const disk = lines(await this.plugin.app.vault.read(file));
-    return views.some((view) => lines(view.getViewData()) !== disk) ? "unsaved" : "saved";
+    return views.every((view) => lines(view.getViewData()) !== disk) ? "unsaved" : "saved";
   }
 
   notify(message: string): void {
