plugin/test/mutants/M330.diff
# M330: a note that landed beside its name never moves when the version that frees the name arrives, so a swap stays split
--- a/plugin/src/sync/pull.ts
+++ b/plugin/src/sync/pull.ts
@@ -830,7 +830,6 @@
     });
     // A version that moved a file off a name, or landed one beside its own,
     // is when a waiting name is most likely free (issue #149).
-    await settleBeside(context, change.seq);
     return applied;
   } catch (error) {
     // Both refusals are the same decision to the user: this version does not
