plugin/test/mutants/M332.diff
# M332: a swap leaves both notes waiting at each other's name, so the two devices show them under opposite names for good
--- a/plugin/src/sync/pull.ts
+++ b/plugin/src/sync/pull.ts
@@ -2682,7 +2682,7 @@
       const want = record.name;
       if (want === undefined) continue;
       const holder = files[want];
-      if (holder !== undefined && holder.name === undefined) continue;
+      if (holder !== undefined) continue;
       let outcome: string;
       try {
         if (!(await movable(context, path, record))) continue;
