plugin/test/mutants/M368.diff
# M368: an engine started again runs its stopped feed beside the new one, two polls on one cursor
--- a/plugin/src/sync/engine.ts
+++ b/plugin/src/sync/engine.ts
@@ -1722,7 +1722,7 @@
    */
   private async feedLoop(): Promise<void> {
     const context = this.need();
-    const live = (): boolean => this.running && this.contextValue === context;
+    const live = (): boolean => this.running;
     // THE JOURNAL IS ASKED WHETHER IT WENT BACK, at start and after every
     // failed read -- the moments a server can have been rebuilt from a backup
     // underneath this device (issue #145, `restore.ts`). A read, like the
