plugin/test/mutants/M369.diff
# M369: a folder Save no longer waits for the change being downloaded, and the new selection races it
--- a/plugin/src/sync/engine.ts
+++ b/plugin/src/sync/engine.ts
@@ -1744,7 +1744,7 @@
         // A restore the repair pass noticed while this read waited is answered
         // before anything the read brought is applied.
         if (this.restoreDue !== null) continue;
-        await this.track(this.applyPage(context, page));
+        await this.applyPage(context, page);
       } catch (error) {
         if (!live()) return;
         if (error instanceof ApiError && error.code === "seq_ahead") {
