plugin/test/mutants/M382.diff
# M382: a re-send names the lost version as its parent and forks every note it re-sends
--- a/plugin/src/sync/push.ts
+++ b/plugin/src/sync/push.ts
@@ -308,7 +308,7 @@
     sha256: plaintextHash,
     deleted: false,
   };
-  const parents = over ?? (record && record.versionId !== "" ? [record.versionId] : []);
+  const parents = record && record.versionId !== "" ? [record.versionId] : [];
   // A RENAME IS NEVER OFFERED FOR DEDUPLICATION. The server's identity for a
   // position is `(file_id, parent set, sids, deleted)` and does not cover the
   // encrypted manifest (`docs/protocol.md`, "One position, one version"), and
