plugin/test/mutants/M386.diff
# M386: a deletion this device applied is not remembered, and comes back after a restore
--- a/plugin/src/sync/pull.ts
+++ b/plugin/src/sync/pull.ts
@@ -1417,7 +1417,6 @@
         await context.host.trash(localPath);
       }
       context.state.forgetPath(localPath);
-      bury(context, change.file_id, change.version_id, localPath, false, change.ts);
       await context.state.save();
       context.host.log(`pull path_class=tombstone decision=deleted seq=${change.seq}${open}`);
       await pruneEmptyParents(context, localPath);
