plugin/test/mutants/M397.diff
# M397: the retirement names a version this device never held, so it no longer forks where the id moved on
--- a/plugin/src/sync/pull.ts
+++ b/plugin/src/sync/pull.ts
@@ -3078,7 +3078,7 @@
   if (was?.path !== manifest.path || (await identicalAtName(context, parent, manifest.path, ours)) === null) return null;
   const landed = await materialise(context, manifest);
   await recordAt(context, change, landed.path, landed);
-  const retired = await retire(context, ours.fileId, ours.versionId, manifest.path, change.file_id);
+  const retired = await retire(context, ours.fileId, change.version_id, manifest.path, change.file_id);
   context.host.log(
     `pull decision=converged reason=edited_twin keeper=${change.file_id} retired=${ours.fileId} tombstone=${retired} ` +
       `seq=${change.seq} duration_ms=${context.now() - started}`,
