plugin/test/mutants/M40.diff
# M40: 91: a renamed folder does not take the selection with it
--- a/plugin/src/sync/engine.ts
+++ b/plugin/src/sync/engine.ts
@@ -671,7 +671,6 @@
     // out of scope, every note under a selected folder published as a NEW file
     // with a new id, and the old ids never retired (review round 2, finding 1).
     const before = sourceFolders;
-    this.followSelection(from, to);
     const prefix = `${from}/`;
     // RECORDS ARE NOT THE WHOLE OF WHAT THIS DEVICE OWES. A note written
     // moments ago is still in the debounce, or already in the push queue,
