plugin/test/mutants/M40.diff
# M40: 91: a renamed folder does not take the selection with it
--- a/plugin/src/sync/engine.ts
+++ b/plugin/src/sync/engine.ts
@@ -477,7 +477,6 @@
     // selection never covered is therefore still out of scope on both sides,
     // and moving a selected folder cannot smuggle it into sync.
     const before = this.options.state.data.syncFolders;
-    this.followSelection(from, to);
     const prefix = `${from}/`;
     // RECORDS ARE NOT THE WHOLE OF WHAT THIS DEVICE OWES. A note written
     // moments ago is still in the debounce, or already in the push queue,
