plugin/test/mutants/M411.diff
# M411: a note left for this device's own push is not counted as waiting, so the status reads idle over two different notes
--- a/plugin/src/sync/pull.ts
+++ b/plugin/src/sync/pull.ts
@@ -2088,7 +2088,6 @@
  * `resting`), so a push that never comes cannot hold the status forever.
  */
 function deferred(context: SyncContext, change: ChangeRecord, reason: string): ApplyResult {
-  context.forked.add(change.file_id);
   context.host.log(`pull decision=deferred reason=${reason} file=${change.file_id} seq=${change.seq}`);
   return "skipped";
 }
