plugin/test/mutants/M42.diff
# M42: 91: both sides of the move are judged by the selection after it
--- a/plugin/src/sync/engine.ts
+++ b/plugin/src/sync/engine.ts
@@ -443,7 +443,7 @@
     this.followSelection(from, to);
     const prefix = `${from}/`;
     for (const path of Object.keys(this.options.state.data.files)) {
-      if (path.startsWith(prefix)) this.renamed(path, to + path.slice(from.length), before);
+      if (path.startsWith(prefix)) this.renamed(path, to + path.slice(from.length));
     }
   }
 
