plugin/test/mutants/M429.diff
# M429: every note skipped for the nested vault raises its own 'refused a change' notice
--- a/plugin/src/sync/pull.ts
+++ b/plugin/src/sync/pull.ts
@@ -845,7 +845,7 @@
     if (error instanceof VaultPathError) {
       // Not this device's to write, and not a hostile record: skipped. A
       // nested vault was named to the user once, by the host.
-      if (error.refusal === "outside_sync_scope" || error.refusal === "nested_vault") {
+      if (error.refusal === "outside_sync_scope") {
         context.host.log(`pull path_class=manifest decision=not_synced reason=${error.refusal} file=${change.file_id} seq=${change.seq}`);
         return "skipped";
       }
