plugin/test/mutants/M437.diff
# M437: on a phone, the nested folder's own record is still published and applied
--- a/plugin/src/main.ts
+++ b/plugin/src/main.ts
@@ -451,7 +451,7 @@
     const segments = path.split("/");
     const desktop = this.desktop;
     if (desktop === null) {
-      for (let depth = 1; depth <= segments.length; depth++) {
+      for (let depth = 1; depth < segments.length; depth++) {
         const folder = segments.slice(0, depth).join("/");
         if (await this.plugin.app.vault.adapter.exists(`${folder}/${PLUGIN_FOLDER.join("/")}`)) return this.named(folder);
       }
