plugin/test/mutants/M459.diff
# M459: a keeper that is not a file id is put into a request path
--- a/plugin/src/sync/pull.ts
+++ b/plugin/src/sync/pull.ts
@@ -281,7 +281,6 @@
   if (digest !== "" && !digest32(digest)) throw new ManifestError("sha256");
   // A retirement's keeper is a file id, and it goes into a request path (#181).
   const keeper = value["keeper"];
-  if (keeper !== undefined && (typeof keeper !== "string" || !isHex(keeper, 16))) throw new ManifestError("keeper");
   const chunks = value["chunks"];
   if (!Array.isArray(chunks)) throw new ManifestError("chunks");
   for (const chunk of chunks as unknown[]) {
