plugin/test/mutants/M460.diff
# M460: a folder this device deleted is not remembered, and comes back after a restore
--- a/plugin/src/sync/push.ts
+++ b/plugin/src/sync/push.ts
@@ -522,7 +522,6 @@
   const parents = record.versionId !== "" ? [record.versionId] : [];
   const ack = await postManifest(context, record.fileId, parents, [], folderManifest(context, path, true), 0, false);
   context.state.forgetFolder(path);
-  bury(context, record.fileId, ack.versionId, path, true);
   await context.state.save();
   context.host.log(`folder path_class=folder decision=published reason=deleted version=${ack.versionId}`);
   return ack.versionId;
