plugin/test/mutants/M481.diff
# M481: a note someone is typing in, on a line another device also changed, is paused as if a plugin had rewritten it
--- a/plugin/src/sync/pull.ts
+++ b/plugin/src/sync/pull.ts
@@ -159,7 +159,7 @@
 export async function answerOf(context: SyncContext, path: string, mtime: number): Promise<number | null> {
   const arrived = context.arrivals.get(path);
   if (arrived === undefined || mtime < arrived || mtime - arrived >= ANSWER_MS) return null;
-  return context.host.typing(path) ? null : arrived;
+  return arrived;
 }
 
 export type ApplyResult =
