plugin/test/mutants/M483.diff
# M483: an edit made exactly five seconds after a sync still counts as an answer, and the note pauses
--- a/plugin/src/sync/pull.ts
+++ b/plugin/src/sync/pull.ts
@@ -158,7 +158,7 @@
  */
 export async function answerOf(context: SyncContext, path: string, mtime: number): Promise<number | null> {
   const arrived = context.arrivals.get(path);
-  if (arrived === undefined || mtime < arrived || mtime - arrived >= ANSWER_MS) return null;
+  if (arrived === undefined || mtime < arrived || mtime - arrived > ANSWER_MS) return null;
   return context.host.typing(path) ? null : arrived;
 }
 
