plugin/test/mutants/M485.diff
# M485: a pulled version with a remote timestamp is mistaken for a local background edit
--- a/plugin/src/sync/pull.ts
+++ b/plugin/src/sync/pull.ts
@@ -2368,7 +2368,7 @@
   if (record === undefined || context.host.typing(path)) return null;
   const judged = context.answering.get(fileId);
   const unpushed = record.mtime !== stat.mtime || record.size !== stat.size;
-  return judged?.mtime === stat.mtime ? judged.arrived : unpushed ? await answerOf(context, path, stat.mtime) : null;
+  return judged?.mtime === stat.mtime ? judged.arrived : await answerOf(context, path, stat.mtime);
 }

 /**
