plugin/test/mutants/M485.diff
# M485: a pulled version with a remote timestamp is mistaken for a local background edit
--- a/plugin/src/sync/pull.ts
+++ b/plugin/src/sync/pull.ts
@@ -2229,7 +2229,7 @@
   if (stat === null || record === undefined) return false;
   const judged = context.answering.get(change.file_id);
   const unpushed = record.mtime !== stat.mtime || record.size !== stat.size;
-  const arrived = judged?.mtime === stat.mtime ? judged.arrived : unpushed ? await answerOf(context, localPath, stat.mtime) : null;
+  const arrived = judged?.mtime === stat.mtime ? judged.arrived : await answerOf(context, localPath, stat.mtime);
   if (arrived === null || context.host.typing(localPath)) return false;
   if (context.state.data.paused[change.file_id] !== undefined) return true;
   context.state.data.paused[change.file_id] = { path: localPath };
