plugin/test/mutants/M486.diff
# M486: a paused note keeps taking the other device's versions, and its plugin keeps answering them
--- a/plugin/src/sync/pull.ts
+++ b/plugin/src/sync/pull.ts
@@ -880,10 +880,6 @@
   // a push that was in flight when it paused and came back conflicted. Its
   // versions are asked of the server again, as the file stands then, when it
   // is resumed (`engine.ts`, `resume`).
-  if (context.state.data.paused[change.file_id] !== undefined) {
-    context.host.log(`pull path_class=file decision=skipped reason=paused file=${change.file_id} seq=${change.seq}`);
-    return "skipped";
-  }
   try {
     const entry = await decodeRecordManifest(context, change);
     // NOTHING INTO A VAULT OF ITS OWN, AND NOTHING OUT OF ONE (issue #180):
