plugin/test/mutants/M491.diff
# M491: a restart forgets held notes and restarts their bounce
--- a/plugin/src/state.ts
+++ b/plugin/src/state.ts
@@ -380,7 +380,6 @@
   const paused = loaded["paused"];
   if (isRecord(paused)) {
     for (const [fileId, record] of Object.entries(paused)) {
-      if (isHex(fileId, 16) && isRecord(record) && isVaultPath(record["path"])) data.paused[fileId] = { path: record["path"], ...(record["remote"] === true ? { remote: true } : {}) };
     }
   }
   // The mark names a request path and the graves a request path and a
