plugin/test/mutants/M492.diff
# M492: after a restart the status bar reads idle over a note that is still paused
--- a/plugin/src/sync/engine.ts
+++ b/plugin/src/sync/engine.ts
@@ -661,7 +661,6 @@
       void this.track(this.retryParked("start"));
       // A paused note stays paused across a restart, and says so: the plugin
       // that rewrote it is most likely still there (issue #179).
-      if (Object.keys(state.data.paused).length > 0) this.status(this.resting());
       // Not tracked: only the pages it applies are (`feedLoop`).
       void this.feedLoop().catch((error: unknown) => {
         host.log(`feed decision=failed reason=${error instanceof Error ? error.name : "unknown"}`);
