plugin/test/mutants/M530.diff
# M530: Sync now misses a silent rewrite with unchanged metadata
--- a/plugin/src/sync/engine.ts
+++ b/plugin/src/sync/engine.ts
@@ -2839,7 +2839,7 @@
     await this.resume();
     // An explicit repair command verifies content even when a fixed-width
     // plugin rewrite retained both recorded metadata fields (#179).
-    await this.reconcile(true);
+    await this.reconcile();
     // The command that "syncs everything" did not send the deletions the user
     // is still being asked about, and says so rather than nothing (#172).
     if (pending && this.heldDeletions.length > 0) {
