plugin/test/mutants/M54.diff
# M54: the file is put back and deleted by the name an editor writes to
--- a/plugin/src/main.ts
+++ b/plugin/src/main.ts
@@ -1453,7 +1453,8 @@
     }
     // The destructive call, at last, and aimed at a name no editor writes to.
     const slash = path.lastIndexOf("/") + 1;
-    await this.remove(`${path.slice(0, slash)}${name}/${path.slice(slash)}`);
+    await fs.promises.rename(moved, found.target);
+    await this.remove(path);
     await fs.promises.rmdir(folder).catch(() => this.log("host path_class=folder decision=kept reason=rmdir_refused"));
     // And the hold has the last word, because a rename does not close an
     // editor's DESCRIPTOR: a program that still holds the file open writes
