plugin/test/mutants/M57.diff
# M57: a tombstone is applied without proving the file against its record
--- a/plugin/src/sync/pull.ts
+++ b/plugin/src/sync/pull.ts
@@ -1403,7 +1403,7 @@
       // AND THE EDITOR IS ONE PLACE THOSE BYTES LIVE (issue #146): a note
       // open and being typed in holds its newest keystrokes there until the
       // next save, so it is kept and published again the same way.
-      let held: string | null = await competing(context, localPath, change.file_id);
+      let held: string | null = (await competing(context, localPath, change.file_id)) === "no_record" ? "no_record" : null;
       const editing = held === null && local !== undefined ? await openEditing(context, localPath, local, change) : null;
       if (editing?.held === true) held = "open_editing";
       const open = editing?.fields ?? "";
