plugin/test/mutants/M576.diff
# M576: a directory-shaped control at the same position is adopted as a pause
--- a/plugin/src/sync/push.ts
+++ b/plugin/src/sync/push.ts
@@ -700,7 +700,7 @@
       theirs.path === manifest.path &&
       theirs.size === manifest.size &&
       theirs.deleted === manifest.deleted &&
-      (manifest.v !== 3 || (theirs.v === 3 && theirs.kind === "pause" && theirs.target === manifest.target && theirs.paused === manifest.paused))
+      (manifest.v !== 3 || (theirs.v === 3 && theirs.kind === "pause" && theirs.target === manifest.target && theirs.paused === manifest.paused) || (theirs as { v?: number }).v === 2)
     );
   } catch {
     return false;
