plugin/test/mutants/M620.diff
# M620: both resumes create a second sibling instead of advancing the recorded-answer copy
--- a/plugin/src/sync/pull.ts
+++ b/plugin/src/sync/pull.ts
@@ -2344,7 +2344,8 @@
   if (version === undefined) return "ordinary";
   const recorded = await decryptRecordManifest(context, { ...version, file_id: fileId, domain_id: file.domain_id });
   if (recorded.deleted || recorded.path !== path || recorded.chunks.length !== 1) return "ordinary";
-  const kept = await keepResumed(context, { ...version, file_id: fileId, domain_id: file.domain_id, seq: 0, heads: file.heads, conflicted: true }, version, recorded, mine, before.mtime);
+  const beside = await writeBeside(context, path, context.host.deviceName, new Date(context.now()), mine.length, before.mtime, (writer) => writer.write(mine), async () => null);
+  const kept = beside?.path ?? null;
   if (kept === null) return "no_free_name";
   const other = file.heads.filter((id) => id !== record.versionId);
   const peer = other.length === 1
