plugin/test/mutants/M622.diff
# M622: Resume reads a preserved copy above its single-chunk budget
--- a/plugin/src/sync/pull.ts
+++ b/plugin/src/sync/pull.ts
@@ -2354,7 +2354,7 @@
     const record = context.state.fileByPath(path);
     if (record?.fileId !== id) return fail("identity");
     const before = await context.host.stat(path);
-    if (before === null || before.size > CHUNK_MAX) return fail("local_budget");
+    if (before === null || before.size > CHUNK_MAX * 2) return fail("local_budget");
     const localDigest = await sidDigest([(await encryptChunk(context.domainKey, await context.host.read(path))).sid]);
     if (!known(localDigest)) return fail("local_edit");
     const file = await context.transport.getFile(id);
