plugin/test/mutants/M65.diff
# M65: the adopted version is proved by everything except the path
--- a/plugin/src/sync/push.ts
+++ b/plugin/src/sync/push.ts
@@ -722,7 +722,6 @@
       ),
     ) as Partial<Manifest | PauseManifest>;
     return (
-      theirs.path === manifest.path &&
       theirs.size === manifest.size &&
       theirs.deleted === manifest.deleted &&
       (manifest.v !== 3 || (theirs.v === 3 && theirs.kind === "pause" && theirs.target === manifest.target && theirs.paused === manifest.paused))
