plugin/test/mutants/M657.diff
# M657: identical revivals from two devices are not deduplicated
--- a/plugin/src/sync/push.ts
+++ b/plugin/src/sync/push.ts
@@ -357,7 +357,7 @@
   // their own echo -- `authored` -- and keep two different paths for one file
   // id with no version left that could settle it. Every other post offers it:
   // same parents, same chunks, same path is the same version (issue #114).
-  const ack = await postManifest(context, fileId, parents, sids, manifest, stat.size, tombstone !== undefined || over !== undefined || !force);
+  const ack = await postManifest(context, fileId, parents, sids, manifest, stat.size, over !== undefined || !force);
   // AND ONE THAT APPEARED WHILE IT POSTED. The note is published twice by
   // then, and this device never pulls its own versions (`pull.ts`, ECHOES), so
   // it settles the pair here, by the rule every other device applies to it.
