plugin/test/mutants/M67.diff
# M67: the bulk-deletion floor is removed, so any pass can hold
--- a/plugin/src/sync/engine.ts
+++ b/plugin/src/sync/engine.ts
@@ -2319,7 +2319,7 @@
       );
       this.heldDeletions = kept;
     }
-    if (tombstones && (kept.length > 0 || (missing.length >= BULK_DELETION_MIN && missing.length * 2 > tracked))) {
+    if (tombstones && (kept.length > 0 || (missing.length >= 1 && missing.length * 2 > tracked))) {
       this.heldDeletions = missing;
       context.host.log(
         `${label} decision=refused reason=bulk_deletion candidates=${missing.length} tracked=${tracked} pending=${kept.length}`,
