plugin/test/mutants/M67.diff
# M67: the bulk-deletion floor is removed, so any pass can hold
--- a/plugin/src/sync/engine.ts
+++ b/plugin/src/sync/engine.ts
@@ -1281,7 +1281,7 @@ export class SyncEngine {
     const tracked = Object.keys(context.state.data.files).length;
     if (!tombstones) {
       // Nothing to publish and nothing to decide.
-    } else if (candidates.length >= BULK_DELETION_MIN && candidates.length * 2 > tracked) {
+    } else if (candidates.length >= 1 && candidates.length * 2 > tracked) {
       this.heldDeletions = candidates;
       context.host.log(
         `${label} decision=refused reason=bulk_deletion candidates=${candidates.length} tracked=${tracked}`,
