plugin/test/mutants/M672.diff
# M672: deferred non-Markdown leaves are accessed as loaded editors
--- a/plugin/src/main.ts
+++ b/plugin/src/main.ts
@@ -1742,8 +1742,9 @@
     this.inputWindows.add(target);
     const input = (event: Event): void => {
       if (!event.isTrusted || event.target === null || !("nodeType" in event.target)) return;
-      for (const { view } of this.plugin.app.workspace.getLeavesOfType("markdown")) {
-        if (!(view instanceof MarkdownView) || !view.file || !view.containerEl.contains(event.target as Node)) continue;
+      for (const { view: rawView } of this.plugin.app.workspace.getLeavesOfType("markdown")) {
+        const view = rawView as MarkdownView;
+        if (!view.file || !view.containerEl.contains(event.target as Node)) continue;
         if (event.type !== "focusout" || this.composing.get(view) === view.file.path) this.inputAt.set(view, { path: view.file.path, at: Date.now() });
         if (event.type === "compositionstart") this.composing.set(view, view.file.path);
         if (event.type === "compositionend" || event.type === "focusout") this.composing.delete(view);
