plugin/test/mutants/M68.diff
# M68: a count alone decides a bulk deletion, without the share
--- a/plugin/src/sync/engine.ts
+++ b/plugin/src/sync/engine.ts
@@ -2319,7 +2319,7 @@
       );
       this.heldDeletions = kept;
     }
-    if (tombstones && (kept.length > 0 || (missing.length >= BULK_DELETION_MIN && missing.length * 2 > tracked))) {
+    if (tombstones && (kept.length > 0 || (missing.length >= BULK_DELETION_MIN))) {
       this.heldDeletions = missing;
       context.host.log(
         `${label} decision=refused reason=bulk_deletion candidates=${missing.length} tracked=${tracked} pending=${kept.length}`,
