plugin/test/mutants/M686.diff
# M686: closed file input still applies after a view changes notes
--- a/plugin/src/main.ts
+++ b/plugin/src/main.ts
@@ -1729,7 +1729,7 @@
   /** A passive editor does not make plugin writes into human typing (#179). */
   typing(path: string): boolean {
     return this.plugin.app.workspace.getLeavesOfType("markdown").some(({ view }) => {
-      if (!(view instanceof MarkdownView) || view.file?.path !== path) return false;
+      if (!(view instanceof MarkdownView) || view.file === null) return false;
       const input = this.inputAt.get(view);
       return this.composing.get(view) === path ||
         (input?.path === path && Date.now() - input.at < EDITING_WINDOW_MS);
