plugin/test/mutants/M69.diff
# M69: the periodic scan may clear a hold the startup pass took
--- a/plugin/src/sync/engine.ts
+++ b/plugin/src/sync/engine.ts
@@ -2334,7 +2334,7 @@
             "delete them, confirm it under Settings, obsync, \"Deletions held back\".",
         );
       }
-    } else if (tombstones) {
+    } else {
       this.heldDeletions = [];
       this.bulkNoticeShown = false;
       for (const from of missing) {
