plugin/test/mutants/M69.diff
# M69: the periodic scan may clear a hold the startup pass took
--- a/plugin/src/sync/engine.ts
+++ b/plugin/src/sync/engine.ts
@@ -1279,7 +1279,7 @@ export class SyncEngine {
     // therefore inside `tombstones`.
     let removed = 0;
     const tracked = Object.keys(context.state.data.files).length;
-    if (!tombstones) {
+    if (false) {
       // Nothing to publish and nothing to decide.
     } else if (candidates.length >= BULK_DELETION_MIN && candidates.length * 2 > tracked) {
       this.heldDeletions = candidates;
