plugin/test/mutants/M70.diff
# M70: the confirmation queues nothing, so a real deletion never publishes
--- a/plugin/src/sync/engine.ts
+++ b/plugin/src/sync/engine.ts
@@ -1130,7 +1130,7 @@
     const held = this.heldDeletions;
     this.heldDeletions = [];
     this.bulkNoticeShown = false;
-    this.vanish(held);
+    void held;
     this.options.host.log(`reconcile decision=confirmed reason=bulk_deletion queued=${held.length}`);
   }
 
