plugin/test/mutants/M702.diff
# M702: a local in-flight head is mistaken for the peer editor
--- a/plugin/src/sync/pull.ts
+++ b/plugin/src/sync/pull.ts
@@ -2348,7 +2348,7 @@
   if (kept === null) return "no_free_name";
   const other = file.heads.filter((id) => id !== record.versionId);
   const peer = other.length === 1
-    ? file.versions.find((candidate) => candidate.version_id === other[0] && candidate.device_id !== context.deviceId)
+    ? file.versions.find((candidate) => candidate.version_id === other[0])
     : undefined;
   const restored = peer === undefined ? version : peer;
   const restore = peer === undefined ? recorded : await decryptRecordManifest(context, { ...peer, file_id: fileId, domain_id: file.domain_id });
