plugin/test/mutants/M710.diff
# M710: twin adoption awaits another digest after checking the replacement boundary
--- a/plugin/src/sync/pull.ts
+++ b/plugin/src/sync/pull.ts
@@ -3252,17 +3252,7 @@
     context.host.log(`pull decision=skipped reason=twin_changed_during_lookup file=${change.file_id} seq=${change.seq}`);
     return "skipped";
   }
-  // The digest was already proved equal. Check and replace the identity in
-  // one synchronous turn: recordAt would await another digest after the check.
-  context.state.setFile(manifest.path, {
-    fileId: change.file_id,
-    versionId: change.version_id,
-    mtime: checked.mtime,
-    size: checked.size,
-    sha256: ours.sha256,
-    ts: change.ts,
-  });
-  await context.state.save();
+  await recordAt(context, change, manifest.path, checked);
   const retired = await retire(context, ours.fileId, ours.versionId, manifest.path, change.file_id);
   context.host.log(
     `pull decision=converged reason=identical_same_name role=yield keeper=${change.file_id} retired=${ours.fileId} tombstone=${retired} seq=${change.seq}`,
