plugin/test/mutants/M711.diff
# M711: twin adoption checks the identity before the awaited file recheck
--- a/plugin/src/sync/pull.ts
+++ b/plugin/src/sync/pull.ts
@@ -2385,8 +2385,9 @@
     context.host.log(`pull decision=skipped reason=historical_twin file=${change.file_id} seq=${change.seq}`);
     return "skipped";
   }
+  const expected = context.state.fileByPath(manifest.path);
   const checked = await identicalAtName(context, change, manifest.path, ours);
-  if (checked === null || context.state.fileByPath(manifest.path) !== ours) {
+  if (checked === null || expected !== ours) {
     context.host.log(`pull decision=skipped reason=twin_changed_during_lookup file=${change.file_id} seq=${change.seq}`);
     return "skipped";
   }
