plugin/test/mutants/M716.diff
# M716: obsolete typing frames are merged and consume the loop budget
--- a/plugin/src/sync/pull.ts
+++ b/plugin/src/sync/pull.ts
@@ -1987,19 +1987,6 @@
   localPath: string,
   localVersionId: string,
 ): Promise<ApplyResult> {
-  // Obsolete feed entries are not new forks. Counting and merging each one
-  // while catching up can trip the loop breaker on an ordinary typing burst.
-  // The file endpoint caps older versions, but includes EVERY current head.
-  // Its truncated ancestry cannot prove that an old fork was incorporated:
-  // requiring that proof recreated historical copies on a fresh device.
-  // A complete, nonempty head view proves this incoming version is obsolete;
-  // leave local bytes untouched and let later feed entries advance them.
-  const completeHeads = file.heads.length > 0 &&
-    file.heads.every(head => file.versions.some(version => version.version_id === head));
-  if (completeHeads && !file.heads.includes(change.version_id)) {
-    context.host.log(`pull decision=skipped reason=superseded_head file=${change.file_id} seq=${change.seq}`);
-    return "skipped";
-  }
   // THE BREAKER. Everything below is bounded by construction, but a bound
   // that rests on an argument is not a bound: the cost of being wrong here is
   // a device filling the server's journal and its owner's quota, on battery.
