plugin/test/mutants/M720.diff
# M720: unrelated forks reset the loop budget without ancestor proof
--- a/plugin/src/sync/pull.ts
+++ b/plugin/src/sync/pull.ts
@@ -2037,7 +2037,6 @@
   const remotes = tally.remote ?? new Map<string, string>();
   const remote = remotes.get(change.device_id);
   const independent = remote !== undefined && remote !== change.version_id &&
-    reaches(file.versions, change.version_id, remote) &&
     !reaches(file.versions, change.version_id, localVersionId);
   if (tally.left !== found || independent) {
     tally.count = 0;
