plugin/test/mutants/M737.diff
# M737: deduplicate equal text that changes different starting lines
--- a/plugin/src/sync/conflict.ts
+++ b/plugin/src/sync/conflict.ts
@@ -148,7 +148,7 @@
     const theirs = right[t];
     let next: LineEdit;
     if (mine && theirs) {
-      if (mine.start === theirs.start && mine.end === theirs.end && sameLines(mine.lines, theirs.lines)) {
+      if (mine.end === theirs.end && sameLines(mine.lines, theirs.lines)) {
         next = mine; m++; t++;
       } else if (
         mine.start === theirs.start && mine.end === theirs.end &&
