plugin/test/mutants/M748.diff
# M748: repeat the unchanged matching anchor inside the next edit
--- a/plugin/src/sync/conflict.ts
+++ b/plugin/src/sync/conflict.ts
@@ -99,7 +99,7 @@
       edits.push({ start, end: at, lines: side.slice(sideStart, there) });
     }
     start = at + 1;
-    sideStart = there + 1;
+    sideStart = there;
   }
   return edits;
 }
