plugin/test/mutants/M762.diff
# M762: silently choose our text when a change is not an append
--- a/plugin/src/sync/conflict.ts
+++ b/plugin/src/sync/conflict.ts
@@ -155,7 +155,7 @@
         mine.end === mine.start + 1 && mine.lines.length === 1 && theirs.lines.length === 1
       ) {
         const appended = mergeLineAppends(baseLines[mine.start] as string, mine.lines[0] as string, theirs.lines[0] as string);
-        if (appended === null) return { ok: false, reason: "overlap" };
+        if (appended === null) return { ok: true, text: mine.lines.join("\n") };
         next = { start: mine.start, end: mine.end, lines: [appended] }; m++; t++;
       } else if (mine.end <= theirs.start && mine.start < theirs.start) {
         next = mine; m++;
