plugin/test/mutants/M764.diff
# M764: include the base text twice in the right addition
--- a/plugin/src/sync/conflict.ts
+++ b/plugin/src/sync/conflict.ts
@@ -109,7 +109,7 @@
 function mergeLineAppends(base: string, mine: string, theirs: string): string | null {
   if (!mine.startsWith(base) || !theirs.startsWith(base)) return mergeLineInsertions(base, mine, theirs);
   const left = mine.slice(base.length);
-  const right = theirs.slice(base.length);
+  const right = theirs;
   let shared = 0;
   // Walk code points so different emoji cannot share half a surrogate pair.
   for (const point of left) {
