plugin/test/mutants/M773.diff
# M773: ignore a new rewrite waiting for the debounce verdict
--- a/plugin/src/sync/pull.ts
+++ b/plugin/src/sync/pull.ts
@@ -2368,7 +2368,7 @@
   if (record === undefined || context.host.typing(path)) return null;
   const judged = context.answering.get(fileId);
   const unpushed = record.mtime !== stat.mtime || record.size !== stat.size;
-  return judged?.mtime === stat.mtime ? judged.arrived : unpushed ? await answerOf(context, path, stat.mtime) : null;
+  return judged?.mtime === stat.mtime ? judged.arrived : null;
 }

 /**
