plugin/test/mutants/M775.diff
# M775: overwrite the arrival clock before preserving the waiting save
--- a/plugin/src/sync/engine.ts
+++ b/plugin/src/sync/engine.ts
@@ -1907,7 +1907,6 @@
       const local = context.state.fileByPath(path);
       if (stat !== null && local?.fileId === change.file_id &&
         (local.mtime !== stat.mtime || local.size !== stat.size)) {
-        await this.answered(context, stat);
         context.host.log(`watch decision=edit_verdict_preserved reason=arrival_advanced file=${change.file_id} seq=${change.seq}`);
       }
       context.arrivals.delete(path);
