plugin/test/mutants/M776.diff
# M776: remember arrivals only after a host plugin can answer the write
--- a/plugin/src/sync/pull.ts
+++ b/plugin/src/sync/pull.ts
@@ -909,7 +909,6 @@
     // The engine must remember an authenticated arrival before a host plugin
     // can answer the write below. Echoes, invalid manifests and nested vaults
     // return before this point.
-    if (entry.v === 1) await incoming?.();
     const applied = await applyVersion(context, change, entry).catch((error: unknown) => {
       // A write THIS device's disk refused, or a chunk the server does not
       // hold: a fact about this one record, named with the path it was for,
