plugin/test/mutants/M777.diff
# M777: derive arrival evidence from echoes and ignored nested entries
--- a/plugin/src/sync/engine.ts
+++ b/plugin/src/sync/engine.ts
@@ -1926,7 +1926,7 @@
     }
     // First materialisation and renames can establish a different tracked
     // path. Only an authenticated ordinary version supplies this evidence.
-    if (incoming) await remember();
+    await remember();
     if (context.state.data.parked[change.file_id] !== undefined) await this.retryOne(context, change.file_id);
     return result;
   }
