plugin/test/mutants/M81.diff
# M81: the case-only folder record is enqueued first and not held to
--- a/plugin/src/sync/engine.ts
+++ b/plugin/src/sync/engine.ts
@@ -870,7 +870,7 @@
     const barrier = caseOnly(from, to);
     for (const path of [from, ...recorded.filter((candidate) => candidate.startsWith(`${from}/`))]) {
       this.folderDeleted(path, sourceFolders);
-      this.folderCreated(to + path.slice(from.length), barrier && path === from);
+      this.folderCreated(to + path.slice(from.length), false);
     }
   }
 
