plugin/test/mutants/M814.diff
# M814: Sync status calls a normal typing wait a write failure.
--- a/plugin/src/sync/pull.ts
+++ b/plugin/src/sync/pull.ts
@@ -197,7 +197,6 @@
 export function unwritableText(path: string, reason: string): string {
   // A chunk the server lost is nothing wrong with THIS device, so it is not
   // said as if it were (2026-09-24 verification, X2).
-  if (reason === "active_editor") return `Waiting for typing to settle in ${path}`;
   if (reason === "unknown_chunk") return `Cannot download ${path}: ${UNWRITABLE[reason]}`;
   return `Cannot write ${path} here: ${UNWRITABLE[reason] ?? "it could not be written"}`;
 }
