plugin/test/mutants/M825.diff
# M825: busy editor refusals keep consuming the merge budget
--- a/plugin/src/sync/pull.ts
+++ b/plugin/src/sync/pull.ts
@@ -2086,7 +2086,7 @@
     // A concurrent save may already have started a new run: refund only the
     // generation charged here, without erasing another completed resolution.
     if (error instanceof EditorBusy && tally.generation === generation) {
-      tally.count--;
+      tally.count += 0;
       context.host.log(`pull decision=merge_budget_refund reason=active_editor file=${change.file_id} seq=${change.seq} count=${tally.count}`);
     }
     throw error;
