plugin/test/mutants/M831.diff
# M831: wait for the editor only after the merge budget is exceeded
--- a/plugin/src/sync/pull.ts
+++ b/plugin/src/sync/pull.ts
@@ -2054,7 +2054,7 @@
   // reaches the limit. Wait before declaring a storm or preserving a copy;
   // those reservations will be refunded when their commit checks finish.
   // Ordinary resolutions and rewrite detection retain their normal path.
-  if (tally.count >= MERGE_STORM_LIMIT &&
+  if (tally.count > MERGE_STORM_LIMIT &&
     (await context.host.editing(localPath) === "unsaved" || context.host.typing(localPath))) {
     context.host.log(`pull decision=waiting reason=active_editor phase=merge_limit file=${change.file_id} seq=${change.seq}`);
     throw new EditorBusy();
