plugin/test/mutants/M85.diff
# M85: the scan's move pairing stops asking about a directory's case
--- a/plugin/src/sync/engine.ts
+++ b/plugin/src/sync/engine.ts
@@ -1324,12 +1324,6 @@
         context.state.fileByPath(file.path) === undefined);
       if (candidates.length !== 1) continue;
       const to = (candidates[0] as VaultStat).path;
-      if (await this.recordsOnly(context, from, to, recordedFolders, label)) {
-        settled.add(to);
-        settled.add(from);
-        declined++;
-        continue;
-      }
       if (!(await context.host.syncable(to))) { skipped++; continue; }
       settled.add(to);
       settled.add(from);
