plugin/test/mutants/M95.diff
# M95: a retried folder record is put back without its barrier
--- a/plugin/src/sync/engine.ts
+++ b/plugin/src/sync/engine.ts
@@ -1398,7 +1398,7 @@
       return;
     }
     this.folderRetries.set(path, attempt);
-    this.publishFolder(path, barrier);
+    this.publishFolder(path, false);
     // In FRONT: what this record orders is already queued behind it.
     if (!this.queue.includes(path)) this.queue.unshift(path);
     context.host.log(
